//COMPRESS JOB MSGCLASS=A,CLASS=A
//*--------------------------------------------------------------------
//COMPRESS EXEC PGM=IEBCOPY
//SYSPRINT  DD DUMMY
//LINKLIB   DD DSN=SYS2.LOCAL.LINKLIB,DISP=SHR
//SVCLIB    DD DSN=SYS1.SVCLIB,DISP=SHR
//SYSUT1    DD UNIT=SYSDA,SPACE=(CYL,(20,20))
//SYSUT2    DD UNIT=SYSDA,SPACE=(CYL,(20,20))
//SYSIN     DD *
  COPY INDD=LINKLIB,OUTDD=LINKLIB
  COPY INDD=SVCLIB,OUTDD=SVCLIB
//
 


