//XINU    JOB  CLASS=A,MSGCLASS=A,REGION=2048K
//GO       EXEC PGM=XINU
//STEPLIB   DD DSN=SYS2.LOCAL.LINKLIB,DISP=SHR
//SYSPRINT  DD SYSOUT=*
//STDOUT    DD SYSOUT=*
//STDERR    DD SYSOUT=*
//STDIN     DD DUMMY
//SYSUDUMP  DD SYSOUT=*
//

